---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotDimLeaderLine
source: html/7c3394d2-9e85-534b-2e05-d82f3825717f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotDimLeaderLine Property

"Leader Line"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotDimLeaderLine { get; }
```